; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	satellite3 - satellite
	instrument3 - instrument
	satellite4 - satellite
	instrument4 - instrument
	thermograph0 - mode
	infrared3 - mode
	image2 - mode
	image1 - mode
	spectrograph4 - mode
	Star1 - direction
	Star2 - direction
	GroundStation3 - direction
	Star4 - direction
	GroundStation6 - direction
	Star12 - direction
	Star5 - direction
	GroundStation13 - direction
	Star8 - direction
	GroundStation0 - direction
	GroundStation10 - direction
	Star14 - direction
	Star11 - direction
	GroundStation7 - direction
	Star9 - direction
	Star15 - direction
	Phenomenon16 - direction
	Planet17 - direction
	Star18 - direction
	Star19 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 infrared3)
	(supports instrument0 image2)
	(calibration_target instrument0 Star8)
	(calibration_target instrument0 Star14)
	(calibration_target instrument0 Star5)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star2)
	(supports instrument1 image2)
	(supports instrument1 spectrograph4)
	(calibration_target instrument1 GroundStation13)
	(calibration_target instrument1 Star8)
	(calibration_target instrument1 Star11)
	(calibration_target instrument1 Star14)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation10)
	(supports instrument2 infrared3)
	(calibration_target instrument2 Star9)
	(calibration_target instrument2 Star8)
	(on_board instrument2 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation7)
	(supports instrument3 image1)
	(calibration_target instrument3 Star9)
	(calibration_target instrument3 Star14)
	(calibration_target instrument3 GroundStation10)
	(calibration_target instrument3 GroundStation0)
	(on_board instrument3 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star14)
	(supports instrument4 thermograph0)
	(calibration_target instrument4 Star9)
	(calibration_target instrument4 GroundStation7)
	(calibration_target instrument4 Star11)
	(on_board instrument4 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star1)
)
(:goal (and
	(pointing satellite0 Phenomenon16)
	(pointing satellite1 GroundStation6)
	(have_image Star15 image1)
	(have_image Phenomenon16 image2)
	(have_image Planet17 spectrograph4)
	(have_image Star18 thermograph0)
	(have_image Star19 thermograph0)
))

)

; plan
1. (switch_on instrument3 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument3)
   goals met: 0 of 7
2. (calibrate satellite3 instrument3 star14)
   added: (calibrated instrument3)
   goals met: 0 of 7
3. (turn_to satellite3 star15 star14)
   deleted: (pointing satellite3 star14)
   added: (pointing satellite3 star15)
   goals met: 0 of 7
4. (turn_to satellite1 groundstation13 groundstation10)
   deleted: (pointing satellite1 groundstation10)
   added: (pointing satellite1 groundstation13)
   goals met: 0 of 7
5. (turn_to satellite0 star14 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star14)
   goals met: 0 of 7
6. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 7
7. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 7
8. (calibrate satellite1 instrument1 groundstation13)
   added: (calibrated instrument1)
   goals met: 0 of 7
9. (calibrate satellite0 instrument0 star14)
   added: (calibrated instrument0)
   goals met: 0 of 7
10. (take_image satellite3 star15 instrument3 image1)
   added: (have_image star15 image1)
   goals met: 1 of 7
11. (turn_to satellite0 star18 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 star18)
   goals met: 1 of 7
12. (take_image satellite0 star18 instrument0 thermograph0)
   added: (have_image star18 thermograph0)
   goals met: 2 of 7
13. (turn_to satellite0 star19 star18)
   deleted: (pointing satellite0 star18)
   added: (pointing satellite0 star19)
   goals met: 2 of 7
14. (take_image satellite0 star19 instrument0 thermograph0)
   added: (have_image star19 thermograph0)
   goals met: 3 of 7
15. (turn_to satellite0 phenomenon16 star19)
   deleted: (pointing satellite0 star19)
   added: (pointing satellite0 phenomenon16)
   goals met: 4 of 7
16. (take_image satellite0 phenomenon16 instrument0 image2)
   added: (have_image phenomenon16 image2)
   goals met: 5 of 7
17. (turn_to satellite1 planet17 groundstation13)
   deleted: (pointing satellite1 groundstation13)
   added: (pointing satellite1 planet17)
   goals met: 5 of 7
18. (take_image satellite1 planet17 instrument1 spectrograph4)
   added: (have_image planet17 spectrograph4)
   goals met: 6 of 7
19. (turn_to satellite1 groundstation6 planet17)
   deleted: (pointing satellite1 planet17)
   added: (pointing satellite1 groundstation6)
   goals met: 7 of 7
